const hiragana = [
    {
        "w" : "あ",
        "p" : "a"
    },
    {
        "w" : "い",
        "p" : "i"
    },
    {
        "w" : "う",
        "p" : "u"
    },
    {
        "w" : "え",
        "p" : "e"
    },
    {
        "w" : "お",
        "p" : "o"
    },
    {
        "w" : "か",
        "p" : "ka"
    },
    {
        "w" : "き",
        "p" : "ki"
    },
    {
        "w" : "く",
        "p" : "ku"
    },
    {
        "w" : "け",
        "p" : "ke"
    },
    {
        "w" : "こ",
        "p" : "ko"
    },
    {
        "w" : "さ",
        "p" : "sa"
    },
    {
        "w" : "し",
        "p" : "si"
    },
    {
        "w" : "す",
        "p" : "su"
    },
    {
        "w" : "せ",
        "p" : "se"
    },
    {
        "w" : "そ",
        "p" : "so"
    },
    {
        "w" : "た",
        "p" : "ta"
    },
    {
        "w" : "ち",
        "p" : "chi"
    },
    {
        "w" : "つ",
        "p" : "tsu"
    },
    {
        "w" : "て",
        "p" : "te"
    },
    {
        "w" : "と",
        "p" : "to"
    },
    {
        "w" : "な",
        "p" : "na"
    },
    {
        "w" : "に",
        "p" : "ni"
    },
    {
        "w" : "ぬ",
        "p" : "nu"
    },
    {
        "w" : "ね",
        "p" : "ne"
    },
    {
        "w" : "の",
        "p" : "no"
    },
    {
        "w" : "は",
        "p" : "ha"
    },
    {
        "w" : "ひ",
        "p" : "hi"
    },
    {
        "w" : "ふ",
        "p" : "fu"
    },
    {
        "w" : "へ",
        "p" : "he"
    },
    {
        "w" : "ほ",
        "p" : "ho"
    },
    {
        "w" : "ま",
        "p" : "ma"
    },
    {
        "w" : "み",
        "p" : "mi"
    },
    {
        "w" : "む",
        "p" : "mu"
    },
    {
        "w" : "め",
        "p" : "me"
    },
    {
        "w" : "も",
        "p" : "mo"
    },
    {
        "w" : "や",
        "p" : "ya"
    },
    {
        "w" : "ゆ",
        "p" : "yu"
    },
    {
        "w" : "よ",
        "p" : "yo"
    },
    {
        "w" : "ら",
        "p" : "ra"
    },
    {
        "w" : "り",
        "p" : "ri"
    },
    {
        "w" : "る",
        "p" : "ru"
    },
    {
        "w" : "れ",
        "p" : "re"
    },
    {
        "w" : "ろ",
        "p" : "ro"
    },
    {
        "w" : "わ",
        "p" : "wa"
    },
    {
        "w" : "を",
        "p" : "wo"
    },
    {
        "w" : "ん",
        "p" : "n"
    }
];

const hiratak = [
    {
        "w" : "が",
        "p" : "ga"
    },
    {
        "w" : "ぎ",
        "p" : "gi"
    },
    {
        "w" : "ぐ",
        "p" : "gu"
    },
    {
        "w" : "げ",
        "p" : "ge"
    },
    {
        "w" : "ご",
        "p" : "go"
    },
    {
        "w" : "ざ",
        "p" : "za"
    },
    {
        "w" : "じ",
        "p" : "ji"
    },
    {
        "w" : "ず",
        "p" : "zu"
    },
    {
        "w" : "ぜ",
        "p" : "ze"
    },
    {
        "w" : "ぞ",
        "p" : "zo"
    },
    {
        "w" : "だ",
        "p" : "da"
    },
    {
        "w" : "で",
        "p" : "de"
    },
    {
        "w" : "ど",
        "p" : "do"
    },
    {
        "w" : "ば",
        "p" : "ba"
    },
    {
        "w" : "び",
        "p" : "bi"
    },
    {
        "w" : "ぶ",
        "p" : "bu"
    },
    {
        "w" : "べ",
        "p" : "be"
    },
    {
        "w" : "ぼ",
        "p" : "bo"
    },
    {
        "w" : "ぱ",
        "p" : "pa"
    },
    {
        "w" : "ぴ",
        "p" : "pi"
    },
    {
        "w" : "ぷ",
        "p" : "pu"
    },
    {
        "w" : "ぺ",
        "p" : "pe"
    },
    {
        "w" : "ぽ",
        "p" : "po"
    }
];

const hirayoeum = [
    {
        "w" : "きゃ",
        "p" : "kya"
    },
    {
        "w" : "きゅ",
        "p" : "kyu"
    },
    {
        "w" : "きょ",
        "p" : "kyo"
    },
    {
        "w" : "しゃ",
        "p" : "sha"
    },
    {
        "w" : "しゅ",
        "p" : "shu"
    },
    {
        "w" : "しょ",
        "p" : "sho"
    },
    {
        "w" : "ちゃ",
        "p" : "cha"
    },
    {
        "w" : "ちゅ",
        "p" : "chu"
    },
    {
        "w" : "ちょ",
        "p" : "cho"
    },
    {
        "w" : "にゃ",
        "p" : "nya"
    },
    {
        "w" : "にゅ",
        "p" : "nyu"
    },
    {
        "w" : "にょ",
        "p" : "nyo"
    },
    {
        "w" : "ひゃ",
        "p" : "hya"
    },
    {
        "w" : "ひゅ",
        "p" : "hyu"
    },
    {
        "w" : "ひょ",
        "p" : "hyo"
    },
    {
        "w" : "みゃ",
        "p" : "mya"
    },
    {
        "w" : "みゅ",
        "p" : "myu"
    },
    {
        "w" : "みょ",
        "p" : "myo"
    },
    {
        "w" : "りゃ",
        "p" : "rya"
    },
    {
        "w" : "りゅ",
        "p" : "ryu"
    },
    {
        "w" : "りょ",
        "p" : "ryo"
    }
];

const hirayotak = [
    {
        "w" : "ぎゃ",
        "p" : "gya"
    },
    {
        "w" : "ぎゅ",
        "p" : "gyu"
    },
    {
        "w" : "ぎょ",
        "p" : "gyo"
    },
    {
        "w" : "じゃ",
        "p" : "ja"
    },
    {
        "w" : "じゅ",
        "p" : "ju"
    },
    {
        "w" : "じょ",
        "p" : "jo"
    },
    {
        "w" : "びゃ",
        "p" : "bya"
    },
    {
        "w" : "びゅ",
        "p" : "byu"
    },
    {
        "w" : "びょ",
        "p" : "byo"
    },
    {
        "w" : "ぴゃ",
        "p" : "pya"
    },
    {
        "w" : "ぴゅ",
        "p" : "pyu"
    },
    {
        "w" : "ぴょ",
        "p" : "pyo"
    }
];