const katakana = [
    {
        "w" : "ア",
        "p" : "a"
    },
    {
        "w" : "イ",
        "p" : "i"
    },
    {
        "w" : "ウ",
        "p" : "u"
    },
    {
        "w" : "エ",
        "p" : "e"
    },
    {
        "w" : "オ",
        "p" : "o"
    },
    {
        "w" : "カ",
        "p" : "ka"
    },
    {
        "w" : "キ",
        "p" : "ki"
    },
    {
        "w" : "ク",
        "p" : "ku"
    },
    {
        "w" : "ケ",
        "p" : "ke"
    },
    {
        "w" : "コ",
        "p" : "ko"
    },
    {
        "w" : "サ",
        "p" : "sa"
    },
    {
        "w" : "シ",
        "p" : "si"
    },
    {
        "w" : "ス",
        "p" : "su"
    },
    {
        "w" : "セ",
        "p" : "se"
    },
    {
        "w" : "ソ",
        "p" : "so"
    },
    {
        "w" : "タ",
        "p" : "ta"
    },
    {
        "w" : "チ",
        "p" : "chi"
    },
    {
        "w" : "ツ",
        "p" : "tsu"
    },
    {
        "w" : "テ",
        "p" : "te"
    },
    {
        "w" : "ト",
        "p" : "to"
    },
    {
        "w" : "ナ",
        "p" : "na"
    },
    {
        "w" : "ニ",
        "p" : "ni"
    },
    {
        "w" : "ヌ",
        "p" : "nu"
    },
    {
        "w" : "ネ",
        "p" : "ne"
    },
    {
        "w" : "ノ",
        "p" : "no"
    },
    {
        "w" : "ハ",
        "p" : "ha"
    },
    {
        "w" : "ヒ",
        "p" : "hi"
    },
    {
        "w" : "フ",
        "p" : "fu"
    },
    {
        "w" : "ヘ",
        "p" : "he"
    },
    {
        "w" : "ホ",
        "p" : "ho"
    },
    {
        "w" : "マ",
        "p" : "ma"
    },
    {
        "w" : "ミ",
        "p" : "mi"
    },
    {
        "w" : "ム",
        "p" : "mu"
    },
    {
        "w" : "メ",
        "p" : "me"
    },
    {
        "w" : "モ",
        "p" : "mo"
    },
    {
        "w" : "ヤ",
        "p" : "ya"
    },
    {
        "w" : "ユ",
        "p" : "yu"
    },
    {
        "w" : "ヨ",
        "p" : "yo"
    },
    {
        "w" : "ラ",
        "p" : "ra"
    },
    {
        "w" : "リ",
        "p" : "ri"
    },
    {
        "w" : "ル",
        "p" : "ru"
    },
    {
        "w" : "レ",
        "p" : "re"
    },
    {
        "w" : "ロ",
        "p" : "ro"
    },
    {
        "w" : "ワ",
        "p" : "wa"
    },
    {
        "w" : "ヲ",
        "p" : "wo"
    },
    {
        "w" : "ン",
        "p" : "n"
    }
];

const katatak = [
    {
        "w" : "ガ",
        "p" : "ga"
    },
    {
        "w" : "ギ",
        "p" : "gi"
    },
    {
        "w" : "グ",
        "p" : "gu"
    },
    {
        "w" : "ゲ",
        "p" : "ge"
    },
    {
        "w" : "ゴ",
        "p" : "go"
    },
    {
        "w" : "ザ",
        "p" : "za"
    },
    {
        "w" : "ジ",
        "p" : "ji"
    },
    {
        "w" : "ズ",
        "p" : "zu"
    },
    {
        "w" : "ゼ",
        "p" : "ze"
    },
    {
        "w" : "ゾ",
        "p" : "zo"
    },
    {
        "w" : "ダ",
        "p" : "da"
    },
    {
        "w" : "デ",
        "p" : "de"
    },
    {
        "w" : "ド",
        "p" : "do"
    },
    {
        "w" : "バ",
        "p" : "ba"
    },
    {
        "w" : "ビ",
        "p" : "bi"
    },
    {
        "w" : "ブ",
        "p" : "bu"
    },
    {
        "w" : "ベ",
        "p" : "be"
    },
    {
        "w" : "ボ",
        "p" : "bo"
    },
    {
        "w" : "パ",
        "p" : "pa"
    },
    {
        "w" : "ピ",
        "p" : "pi"
    },
    {
        "w" : "プ",
        "p" : "pu"
    },
    {
        "w" : "ペ",
        "p" : "pe"
    },
    {
        "w" : "ポ",
        "p" : "po"
    }
];

const katayoeum = [
    {
        "w" : "キャ",
        "p" : "kya"
    },
    {
        "w" : "キュ",
        "p" : "kyu"
    },
    {
        "w" : "キョ",
        "p" : "kyo"
    },
    {
        "w" : "シャ",
        "p" : "sha"
    },
    {
        "w" : "シュ",
        "p" : "shu"
    },
    {
        "w" : "ショ",
        "p" : "sho"
    },
    {
        "w" : "チャ",
        "p" : "cha"
    },
    {
        "w" : "チュ",
        "p" : "chu"
    },
    {
        "w" : "チョ",
        "p" : "cho"
    },
    {
        "w" : "ニャ",
        "p" : "nya"
    },
    {
        "w" : "ニュ",
        "p" : "nyu"
    },
    {
        "w" : "ニョ",
        "p" : "nyo"
    },
    {
        "w" : "ヒャ",
        "p" : "hya"
    },
    {
        "w" : "ヒュ",
        "p" : "hyu"
    },
    {
        "w" : "ヒョ",
        "p" : "hyo"
    },
    {
        "w" : "ミャ",
        "p" : "mya"
    },
    {
        "w" : "ミュ",
        "p" : "myu"
    },
    {
        "w" : "ミョ",
        "p" : "myo"
    },
    {
        "w" : "リャ",
        "p" : "rya"
    },
    {
        "w" : "リュ",
        "p" : "ryu"
    },
    {
        "w" : "リョ",
        "p" : "ryo"
    }
];

const katayotak = [
{
        "w" : "ギャ",
        "p" : "gya"
    },
    {
        "w" : "ギュ",
        "p" : "gyu"
    },
    {
        "w" : "ギョ",
        "p" : "gyo"
    },
    {
        "w" : "ジャ",
        "p" : "ja"
    },
    {
        "w" : "ジュ",
        "p" : "ju"
    },
    {
        "w" : "ジョ",
        "p" : "jo"
    },
    {
        "w" : "ビャ",
        "p" : "bya"
    },
    {
        "w" : "ビュ",
        "p" : "byu"
    },
    {
        "w" : "ビョ",
        "p" : "byo"
    },
    {
        "w" : "ピャ",
        "p" : "pya"
    },
    {
        "w" : "ピュ",
        "p" : "pyu"
    },
    {
        "w" : "ピュ",
        "p" : "pyo"
    }
];